Ran Plan for dir: `aws/dev/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
23:15:34.767 STDOUT terraform: data.aws_availability_zones.available: Reading...
23:15:35.103 STDOUT terraform: data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
23:15:35.335 STDOUT terraform: Terraform used the selected providers to generate the following execution
23:15:35.336 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
23:15:35.336 STDOUT terraform:   + create
23:15:35.336 STDOUT terraform: Terraform will perform the following actions:
23:15:35.336 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
23:15:35.336 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
23:15:35.336 STDOUT terraform:       + arn                    = (known after apply)
23:15:35.336 STDOUT terraform:       + default_network_acl_id = (known after apply)
23:15:35.336 STDOUT terraform:       + id                     = (known after apply)
23:15:35.336 STDOUT terraform:       + owner_id               = (known after apply)
23:15:35.336 STDOUT terraform:       + tags                   = {
23:15:35.336 STDOUT terraform:           + "Name" = "dev-vpc-default"
23:15:35.336 STDOUT terraform:         }
23:15:35.336 STDOUT terraform:       + tags_all               = {
23:15:35.336 STDOUT terraform:           + "Name" = "dev-vpc-default"
23:15:35.336 STDOUT terraform:         }
23:15:35.336 STDOUT terraform:       + vpc_id                 = (known after apply)
23:15:35.336 STDOUT terraform:       + egress {
23:15:35.336 STDOUT terraform:           + action          = "allow"
23:15:35.336 STDOUT terraform:           + from_port       = 0
23:15:35.337 STDOUT terraform:           + ipv6_cidr_block = "::/0"
23:15:35.337 STDOUT terraform:           + protocol        = "-1"
23:15:35.337 STDOUT terraform:           + rule_no         = 101
23:15:35.337 STDOUT terraform:           + to_port         = 0
23:15:35.337 STDOUT terraform:             # (1 unchanged attribute hidden)
23:15:35.337 STDOUT terraform:         }
23:15:35.337 STDOUT terraform:       + egress {
23:15:35.337 STDOUT terraform:           + action          = "allow"
23:15:35.337 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
23:15:35.337 STDOUT terraform:           + from_port       = 0
23:15:35.337 STDOUT terraform:           + protocol        = "-1"
23:15:35.337 STDOUT terraform:           + rule_no         = 100
23:15:35.337 STDOUT terraform:           + to_port         = 0
23:15:35.337 STDOUT terraform:             # (1 unchanged attribute hidden)
23:15:35.337 STDOUT terraform:         }
23:15:35.337 STDOUT terraform:       + ingress {
23:15:35.337 STDOUT terraform:           + action          = "allow"
23:15:35.337 STDOUT terraform:           + from_port       = 0
23:15:35.337 STDOUT terraform:           + ipv6_cidr_block = "::/0"
23:15:35.337 STDOUT terraform:           + protocol        = "-1"
23:15:35.337 STDOUT terraform:           + rule_no         = 101
23:15:35.337 STDOUT terraform:           + to_port         = 0
23:15:35.337 STDOUT terraform:             # (1 unchanged attribute hidden)
23:15:35.337 STDOUT terraform:         }
23:15:35.337 STDOUT terraform:       + ingress {
23:15:35.337 STDOUT terraform:           + action          = "allow"
23:15:35.337 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
23:15:35.337 STDOUT terraform:           + from_port       = 0
23:15:35.337 STDOUT terraform:           + protocol        = "-1"
23:15:35.337 STDOUT terraform:           + rule_no         = 100
23:15:35.337 STDOUT terraform:           + to_port         = 0
23:15:35.338 STDOUT terraform:             # (1 unchanged attribute hidden)
23:15:35.338 STDOUT terraform:         }
23:15:35.338 STDOUT terraform:     }
23:15:35.338 STDOUT terraform:   # module.vpc.aws_default_route_table.default[0] will be created
23:15:35.338 STDOUT terraform:   + resource "aws_default_route_table" "default" {
23:15:35.338 STDOUT terraform:       + arn                    = (known after apply)
23:15:35.338 STDOUT terraform:       + default_route_table_id = (known after apply)
23:15:35.338 STDOUT terraform:       + id                     = (known after apply)
23:15:35.338 STDOUT terraform:       + owner_id               = (known after apply)
23:15:35.338 STDOUT terraform:       + route                  = (known after apply)
23:15:35.338 STDOUT terraform:       + tags                   = {
23:15:35.338 STDOUT terraform:           + "Name" = "dev-vpc-default"
23:15:35.338 STDOUT terraform:         }
23:15:35.338 STDOUT terraform:       + tags_all               = {
23:15:35.338 STDOUT terraform:           + "Name" = "dev-vpc-default"
23:15:35.338 STDOUT terraform:         }
23:15:35.338 STDOUT terraform:       + vpc_id                 = (known after apply)
23:15:35.338 STDOUT terraform:       + timeouts {
23:15:35.338 STDOUT terraform:           + create = "5m"
23:15:35.338 STDOUT terraform:           + update = "5m"
23:15:35.338 STDOUT terraform:         }
23:15:35.338 STDOUT terraform:     }
23:15:35.338 STDOUT terraform:   # module.vpc.aws_default_security_group.this[0] will be created
23:15:35.338 STDOUT terraform:   + resource "aws_default_security_group" "this" {
23:15:35.338 STDOUT terraform:       + arn                    = (known after apply)
23:15:35.338 STDOUT terraform:       + description            = (known after apply)
23:15:35.338 STDOUT terraform:       + egress                 = (known after apply)
23:15:35.338 STDOUT terraform:       + id                     = (known after apply)
23:15:35.338 STDOUT terraform:       + ingress                = (known after apply)
23:15:35.338 STDOUT terraform:       + name                   = (known after apply)
23:15:35.338 STDOUT terraform:       + name_prefix            = (known after apply)
23:15:35.338 STDOUT terraform:       + owner_id               = (known after apply)
23:15:35.338 STDOUT terraform:       + revoke_rules_on_delete = false
23:15:35.338 STDOUT terraform:       + tags                   = {
23:15:35.338 STDOUT terraform:           + "Name" = "dev-vpc-default"
23:15:35.338 STDOUT terraform:         }
23:15:35.338 STDOUT terraform:       + tags_all               = {
23:15:35.338 STDOUT terraform:           + "Name" = "dev-vpc-default"
23:15:35.338 STDOUT terraform:         }
23:15:35.338 STDOUT terraform:       + vpc_id                 = (known after apply)
23:15:35.338 STDOUT terraform:     }
23:15:35.339 STDOUT terraform:   # module.vpc.aws_eip.nat[0] will be created
23:15:35.339 STDOUT terraform:   + resource "aws_eip" "nat" {
23:15:35.339 STDOUT terraform:       + allocation_id        = (known after apply)
23:15:35.339 STDOUT terraform:       + arn                  = (known after apply)
23:15:35.339 STDOUT terraform:       + association_id       = (known after apply)
23:15:35.339 STDOUT terraform:       + carrier_ip           = (known after apply)
23:15:35.339 STDOUT terraform:       + customer_owned_ip    = (known after apply)
23:15:35.339 STDOUT terraform:       + domain               = "vpc"
23:15:35.339 STDOUT terraform:       + id                   = (known after apply)
23:15:35.339 STDOUT terraform:       + instance             = (known after apply)
23:15:35.339 STDOUT terraform:       + network_border_group = (known after apply)
23:15:35.339 STDOUT terraform:       + network_interface    = (known after apply)
23:15:35.339 STDOUT terraform:       + private_dns          = (known after apply)
23:15:35.339 STDOUT terraform:       + private_ip           = (known after apply)
23:15:35.339 STDOUT terraform:       + ptr_record           = (known after apply)
23:15:35.339 STDOUT terraform:       + public_dns           = (known after apply)
23:15:35.339 STDOUT terraform:       + public_ip            = (known after apply)
23:15:35.339 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
23:15:35.339 STDOUT terraform:       + tags                 = {
23:15:35.339 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
23:15:35.339 STDOUT terraform:         }
23:15:35.340 STDOUT terraform:       + tags_all             = {
23:15:35.340 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
23:15:35.340 STDOUT terraform:         }
23:15:35.340 STDOUT terraform:       + vpc                  = (known after apply)
23:15:35.340 STDOUT terraform:     }
23:15:35.340 STDOUT terraform:   # module.vpc.aws_internet_gateway.this[0] will be created
23:15:35.340 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
23:15:35.340 STDOUT terraform:       + arn      = (known after apply)
23:15:35.340 STDOUT terraform:       + id       = (known after apply)
23:15:35.340 STDOUT terraform:       + owner_id = (known after apply)
23:15:35.340 STDOUT terraform:       + tags     = {
23:15:35.340 STDOUT terraform:           + "Name" = "dev-vpc"
23:15:35.340 STDOUT terraform:         }
23:15:35.340 STDOUT terraform:       + tags_all = {
23:15:35.340 STDOUT terraform:           + "Name" = "dev-vpc"
23:15:35.340 STDOUT terraform:         }
23:15:35.340 STDOUT terraform:       + vpc_id   = (known after apply)
23:15:35.340 STDOUT terraform:     }
23:15:35.340 STDOUT terraform:   # module.vpc.aws_nat_gateway.this[0] will be created
23:15:35.340 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
23:15:35.340 STDOUT terraform:       + allocation_id                      = (known after apply)
23:15:35.340 STDOUT terraform:       + association_id                     = (known after apply)
23:15:35.340 STDOUT terraform:       + connectivity_type                  = "public"
23:15:35.340 STDOUT terraform:       + id                                 = (known after apply)
23:15:35.340 STDOUT terraform:       + network_interface_id               = (known after apply)
23:15:35.340 STDOUT terraform:       + private_ip                         = (known after apply)
23:15:35.341 STDOUT terraform:       + public_ip                          = (known after apply)
23:15:35.341 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
23:15:35.341 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
23:15:35.341 STDOUT terraform:       + subnet_id                          = (known after apply)
23:15:35.341 STDOUT terraform:       + tags                               = {
23:15:35.341 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
23:15:35.341 STDOUT terraform:         }
23:15:35.341 STDOUT terraform:       + tags_all                           = {
23:15:35.341 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
23:15:35.341 STDOUT terraform:         }
23:15:35.341 STDOUT terraform:     }
23:15:35.341 STDOUT terraform:   # module.vpc.aws_route.private_nat_gateway[0] will be created
23:15:35.341 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
23:15:35.341 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
23:15:35.341 STDOUT terraform:       + id                     = (known after apply)
23:15:35.341 STDOUT terraform:       + instance_id            = (known after apply)
23:15:35.341 STDOUT terraform:       + instance_owner_id      = (known after apply)
23:15:35.341 STDOUT terraform:       + nat_gateway_id         = (known after apply)
23:15:35.341 STDOUT terraform:       + network_interface_id   = (known after apply)
23:15:35.341 STDOUT terraform:       + origin                 = (known after apply)
23:15:35.341 STDOUT terraform:       + route_table_id         = (known after apply)
23:15:35.342 STDOUT terraform:       + state                  = (known after apply)
23:15:35.342 STDOUT terraform:       + timeouts {
23:15:35.342 STDOUT terraform:           + create = "5m"
23:15:35.342 STDOUT terraform:         }
23:15:35.342 STDOUT terraform:     }
23:15:35.342 STDOUT terraform:   # module.vpc.aws_route.public_internet_gateway[0] will be created
23:15:35.342 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
23:15:35.342 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
23:15:35.342 STDOUT terraform:       + gateway_id             = (known after apply)
23:15:35.342 STDOUT terraform:       + id                     = (known after apply)
23:15:35.342 STDOUT terraform:       + instance_id            = (known after apply)
23:15:35.342 STDOUT terraform:       + instance_owner_id      = (known after apply)
23:15:35.342 STDOUT terraform:       + network_interface_id   = (known after apply)
23:15:35.342 STDOUT terraform:       + origin                 = (known after apply)
23:15:35.342 STDOUT terraform:       + route_table_id         = (known after apply)
23:15:35.342 STDOUT terraform:       + state                  = (known after apply)
23:15:35.342 STDOUT terraform:       + timeouts {
23:15:35.342 STDOUT terraform:           + create = "5m"
23:15:35.342 STDOUT terraform:         }
23:15:35.342 STDOUT terraform:     }
23:15:35.342 STDOUT terraform:   # module.vpc.aws_route_table.private[0] will be created
23:15:35.342 STDOUT terraform:   + resource "aws_route_table" "private" {
23:15:35.342 STDOUT terraform:       + arn              = (known after apply)
23:15:35.342 STDOUT terraform:       + id               = (known after apply)
23:15:35.343 STDOUT terraform:       + owner_id         = (known after apply)
23:15:35.343 STDOUT terraform:       + propagating_vgws = (known after apply)
23:15:35.343 STDOUT terraform:       + route            = (known after apply)
23:15:35.343 STDOUT terraform:       + tags             = {
23:15:35.343 STDOUT terraform:           + "Name" = "dev-vpc-private"
23:15:35.343 STDOUT terraform:         }
23:15:35.343 STDOUT terraform:       + tags_all         = {
23:15:35.343 STDOUT terraform:           + "Name" = "dev-vpc-private"
23:15:35.343 STDOUT terraform:         }
23:15:35.343 STDOUT terraform:       + vpc_id           = (known after apply)
23:15:35.343 STDOUT terraform:     }
23:15:35.343 STDOUT terraform:   # module.vpc.aws_route_table.public[0] will be created
23:15:35.343 STDOUT terraform:   + resource "aws_route_table" "public" {
23:15:35.343 STDOUT terraform:       + arn              = (known after apply)
23:15:35.343 STDOUT terraform:       + id               = (known after apply)
23:15:35.343 STDOUT terraform:       + owner_id         = (known after apply)
23:15:35.343 STDOUT terraform:       + propagating_vgws = (known after apply)
23:15:35.343 STDOUT terraform:       + route            = (known after apply)
23:15:35.343 STDOUT terraform:       + tags             = {
23:15:35.343 STDOUT terraform:           + "Name" = "dev-vpc-public"
23:15:35.343 STDOUT terraform:         }
23:15:35.343 STDOUT terraform:       + tags_all         = {
23:15:35.343 STDOUT terraform:           + "Name" = "dev-vpc-public"
23:15:35.343 STDOUT terraform:         }
23:15:35.343 STDOUT terraform:       + vpc_id           = (known after apply)
23:15:35.343 STDOUT terraform:     }
23:15:35.343 STDOUT terraform:   # module.vpc.aws_route_table_association.private[0] will be created
23:15:35.344 STDOUT terraform:   + resource "aws_route_table_association" "private" {
23:15:35.344 STDOUT terraform:       + id             = (known after apply)
23:15:35.344 STDOUT terraform:       + route_table_id = (known after apply)
23:15:35.344 STDOUT terraform:       + subnet_id      = (known after apply)
23:15:35.344 STDOUT terraform:     }
23:15:35.344 STDOUT terraform:   # module.vpc.aws_route_table_association.private[1] will be created
23:15:35.344 STDOUT terraform:   + resource "aws_route_table_association" "private" {
23:15:35.344 STDOUT terraform:       + id             = (known after apply)
23:15:35.344 STDOUT terraform:       + route_table_id = (known after apply)
23:15:35.344 STDOUT terraform:       + subnet_id      = (known after apply)
23:15:35.344 STDOUT terraform:     }
23:15:35.344 STDOUT terraform:   # module.vpc.aws_route_table_association.public[0] will be created
23:15:35.344 STDOUT terraform:   + resource "aws_route_table_association" "public" {
23:15:35.344 STDOUT terraform:       + id             = (known after apply)
23:15:35.344 STDOUT terraform:       + route_table_id = (known after apply)
23:15:35.344 STDOUT terraform:       + subnet_id      = (known after apply)
23:15:35.344 STDOUT terraform:     }
23:15:35.344 STDOUT terraform:   # module.vpc.aws_route_table_association.public[1] will be created
23:15:35.344 STDOUT terraform:   + resource "aws_route_table_association" "public" {
23:15:35.344 STDOUT terraform:       + id             = (known after apply)
23:15:35.344 STDOUT terraform:       + route_table_id = (known after apply)
23:15:35.344 STDOUT terraform:       + subnet_id      = (known after apply)
23:15:35.344 STDOUT terraform:     }
23:15:35.344 STDOUT terraform:   # module.vpc.aws_subnet.private[0] will be created
23:15:35.344 STDOUT terraform:   + resource "aws_subnet" "private" {
23:15:35.344 STDOUT terraform:       + arn                                            = (known after apply)
23:15:35.345 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
23:15:35.345 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
23:15:35.345 STDOUT terraform:       + availability_zone_id                           = (known after apply)
23:15:35.345 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
23:15:35.345 STDOUT terraform:       + enable_dns64                                   = false
23:15:35.345 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:35.345 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:35.345 STDOUT terraform:       + id                                             = (known after apply)
23:15:35.345 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:35.345 STDOUT terraform:       + ipv6_native                                    = false
23:15:35.345 STDOUT terraform:       + map_public_ip_on_launch                        = false
23:15:35.345 STDOUT terraform:       + owner_id                                       = (known after apply)
23:15:35.345 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:35.345 STDOUT terraform:       + tags                                           = {
23:15:35.345 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
23:15:35.345 STDOUT terraform:         }
23:15:35.345 STDOUT terraform:       + tags_all                                       = {
23:15:35.345 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
23:15:35.345 STDOUT terraform:         }
23:15:35.345 STDOUT terraform:       + vpc_id                                         = (known after apply)
23:15:35.346 STDOUT terraform:     }
23:15:35.346 STDOUT terraform:   # module.vpc.aws_subnet.private[1] will be created
23:15:35.346 STDOUT terraform:   + resource "aws_subnet" "private" {
23:15:35.346 STDOUT terraform:       + arn                                            = (known after apply)
23:15:35.346 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
23:15:35.346 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
23:15:35.346 STDOUT terraform:       + availability_zone_id                           = (known after apply)
23:15:35.346 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
23:15:35.346 STDOUT terraform:       + enable_dns64                                   = false
23:15:35.346 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:35.346 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:35.346 STDOUT terraform:       + id                                             = (known after apply)
23:15:35.346 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:35.346 STDOUT terraform:       + ipv6_native                                    = false
23:15:35.346 STDOUT terraform:       + map_public_ip_on_launch                        = false
23:15:35.346 STDOUT terraform:       + owner_id                                       = (known after apply)
23:15:35.346 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:35.346 STDOUT terraform:       + tags                                           = {
23:15:35.346 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
23:15:35.346 STDOUT terraform:         }
23:15:35.346 STDOUT terraform:       + tags_all                                       = {
23:15:35.346 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
23:15:35.346 STDOUT terraform:         }
23:15:35.346 STDOUT terraform:       + vpc_id                                         = (known after apply)
23:15:35.346 STDOUT terraform:     }
23:15:35.346 STDOUT terraform:   # module.vpc.aws_subnet.public[0] will be created
23:15:35.346 STDOUT terraform:   + resource "aws_subnet" "public" {
23:15:35.346 STDOUT terraform:       + arn                                            = (known after apply)
23:15:35.346 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
23:15:35.346 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
23:15:35.347 STDOUT terraform:       + availability_zone_id                           = (known after apply)
23:15:35.347 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
23:15:35.347 STDOUT terraform:       + enable_dns64                                   = false
23:15:35.347 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:35.347 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:35.347 STDOUT terraform:       + id                                             = (known after apply)
23:15:35.347 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:35.347 STDOUT terraform:       + ipv6_native                                    = false
23:15:35.347 STDOUT terraform:       + map_public_ip_on_launch                        = false
23:15:35.347 STDOUT terraform:       + owner_id                                       = (known after apply)
23:15:35.347 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:35.347 STDOUT terraform:       + tags                                           = {
23:15:35.347 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
23:15:35.347 STDOUT terraform:         }
23:15:35.347 STDOUT terraform:       + tags_all                                       = {
23:15:35.347 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
23:15:35.347 STDOUT terraform:         }
23:15:35.347 STDOUT terraform:       + vpc_id                                         = (known after apply)
23:15:35.347 STDOUT terraform:     }
23:15:35.347 STDOUT terraform:   # module.vpc.aws_subnet.public[1] will be created
23:15:35.347 STDOUT terraform:   + resource "aws_subnet" "public" {
23:15:35.347 STDOUT terraform:       + arn                                            = (known after apply)
23:15:35.347 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
23:15:35.347 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
23:15:35.347 STDOUT terraform:       + availability_zone_id                           = (known after apply)
23:15:35.347 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
23:15:35.347 STDOUT terraform:       + enable_dns64                                   = false
23:15:35.347 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
23:15:35.347 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
23:15:35.347 STDOUT terraform:       + id                                             = (known after apply)
23:15:35.347 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
23:15:35.347 STDOUT terraform:       + ipv6_native                                    = false
23:15:35.348 STDOUT terraform:       + map_public_ip_on_launch                        = false
23:15:35.348 STDOUT terraform:       + owner_id                                       = (known after apply)
23:15:35.348 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
23:15:35.348 STDOUT terraform:       + tags                                           = {
23:15:35.348 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
23:15:35.348 STDOUT terraform:         }
23:15:35.348 STDOUT terraform:       + tags_all                                       = {
23:15:35.348 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
23:15:35.348 STDOUT terraform:         }
23:15:35.348 STDOUT terraform:       + vpc_id                                         = (known after apply)
23:15:35.348 STDOUT terraform:     }
23:15:35.348 STDOUT terraform:   # module.vpc.aws_vpc.this[0] will be created
23:15:35.348 STDOUT terraform:   + resource "aws_vpc" "this" {
23:15:35.348 STDOUT terraform:       + arn                                  = (known after apply)
23:15:35.348 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
23:15:35.348 STDOUT terraform:       + default_network_acl_id               = (known after apply)
23:15:35.348 STDOUT terraform:       + default_route_table_id               = (known after apply)
23:15:35.348 STDOUT terraform:       + default_security_group_id            = (known after apply)
23:15:35.348 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
23:15:35.348 STDOUT terraform:       + enable_dns_hostnames                 = true
23:15:35.348 STDOUT terraform:       + enable_dns_support                   = true
23:15:35.348 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
23:15:35.348 STDOUT terraform:       + id                                   = (known after apply)
23:15:35.348 STDOUT terraform:       + instance_tenancy                     = "default"
23:15:35.348 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
23:15:35.348 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
23:15:35.348 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
23:15:35.348 STDOUT terraform:       + main_route_table_id                  = (known after apply)
23:15:35.348 STDOUT terraform:       + owner_id                             = (known after apply)
23:15:35.348 STDOUT terraform:       + tags                                 = {
23:15:35.348 STDOUT terraform:           + "Name" = "dev-vpc"
23:15:35.348 STDOUT terraform:         }
23:15:35.348 STDOUT terraform:       + tags_all                             = {
23:15:35.348 STDOUT terraform:           + "Name" = "dev-vpc"
23:15:35.348 STDOUT terraform:         }
23:15:35.348 STDOUT terraform:     }
23:15:35.348 STDOUT terraform: Plan: 19 to add, 0 to change, 0 to destroy.
23:15:35.348 STDOUT terraform: Changes to Outputs:
23:15:35.348 STDOUT terraform:   + private_subnets = [
23:15:35.349 STDOUT terraform:       + (known after apply),
23:15:35.349 STDOUT terraform:       + (known after apply),
23:15:35.349 STDOUT terraform:     ]
23:15:35.349 STDOUT terraform:   + public_subnets  = [
23:15:35.349 STDOUT terraform:       + (known after apply),
23:15:35.349 STDOUT terraform:       + (known after apply),
23:15:35.349 STDOUT terraform:     ]
23:15:35.349 STDOUT terraform:   + vpc_id          = (known after apply)
23:15:35.349 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
23:15:35.349 STDOUT terraform: Saved the plan to:
23:15:35.349 STDOUT terraform: ./default.tfplan
23:15:35.349 STDOUT terraform: To perform exactly these actions, run the following command to apply:
23:15:35.349 STDOUT terraform:     terraform apply "./default.tfplan"

23:15:38.602 INFO   Retrieved output from terraform
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d aws/dev/vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-17-75:4141/lock?id=ahmedbadawy4%252Fterraform-infrastructure%252Faws%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d aws/dev/vpc
  ```
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```